[
  "Why did the turkey sit in the shade? → ||He didn’t want to be roasted.||",
  "What’s a scarecrow’s favorite fruit? → ||Straw-berries.||",
  "Why do trees hate tests? → ||Because they get stumped.||",
  "What did one autumn leaf say to another? → ||I’m falling for you.||",
  "Why did the pumpkin cross the road? → ||To squash the competition.||",
  "What’s the key to a great Thanksgiving dinner? → ||The tur-KEY, obviously.||",
  "Why was the math book sad in November? → ||It had too many story problems and not enough gravy.||",
  "Why did the cranberry turn red? → ||It saw the turkey dressing.||",
  "What’s a turkey’s favorite type of weather? → ||Fowl conditions.||",
  "Why do pilgrims’ pants keep falling down? → ||They wear their belt buckles on their hats.||",
  "What did the wind say to the leaves? → ||I’m blowing this joint.||",
  "Why did the pie go to therapy? → ||Too many crust issues.||",
  "How do you fix a broken pumpkin? → ||With a pumpkin patch.||",
  "Why was the Thanksgiving soup so expensive? → ||It had 24 carrots.||",
  "What sound does a turkey’s phone make? → ||Wing-wing!||",
  "Why did the football team invite the turkey to play? → ||He was great at the fowl line.||",
  "What’s a leaf’s least favorite month? → ||Decem-brrrr.||",
  "Why was the snowman looking through carrots? → ||He was picking his nose.||",
  "What did the pumpkin say after Thanksgiving dinner? → ||Oh my gourd, I’m stuffed.||",
  "Why did the scarecrow win an award? → ||He was outstanding in his field.||",
  "What kind of music did pilgrims like? → ||Plymouth rock.||",
  "Why did the corn stalk break up with the pumpkin? → ||It was tired of all the gourd drama.||",
  "What happens when winter sneaks up on fall? → ||You get frost in translation.||",
  "What’s a turkey’s least favorite day of the week? → ||Fry-day.||",
  "Why do leaves never get lonely? → ||They stick together.||",
  "What’s a tree’s favorite subject? → ||Geometry—it has plenty of angles.||",
  "Why did the apple pie cry? → ||Its filling got too emotional.||",
  "What do clouds wear under their raincoats? → ||Thunderwear.||",
  "Why don’t pumpkins tell secrets? → ||They might squash them.||",
  "What do you call a running turkey? → ||Fast food.||",
  "Why do leaves always get invited to parties? → ||They’re a-maze-ing dancers.||",
  "What did the pilgrim say at the comedy show? → ||That joke was corn-y!||",
  "Why did the turkey bring a microphone? → ||He wanted to gobble up the crowd.||",
  "What’s a sweater’s favorite holiday? → ||Thanks-knitting.||",
  "Why did the cranberry get promoted? → ||Because it was outstanding in its sauce field.||",
  "What’s a pumpkin’s favorite sport? → ||Squash.||",
  "Why did the squirrel invite friends to dinner? → ||He had a few nuts to share.||",
  "What did the November rain say to the umbrella? → ||Stop covering for me.||",
  "Why do pumpkins make good friends? → ||They have a lot of gourd energy.||",
  "What do you call a polite turkey? → ||Thank-ful.||",
  "Why was the pie cold? → ||It was in the fridge giving everyone the crusty stare.||",
  "What’s a pilgrim’s favorite dance move? → ||The mashed potato.||",
  "Why was the weather report always positive in November? → ||Because every cloud had a silver stuffing.||",
  "What do you call a snowman in November? → ||Lost.||",
  "Why did the fork and knife get along? → ||They always stuck together at the table.||",
  "What’s the best way to talk to a turkey? → ||Use drumsticks.||",
  "Why did the pumpkin fail at school? → ||It couldn’t concentrate on its gourd work.||",
  "How do autumn leaves get around? → ||They take the fall bus.||",
  "Why did the farmer start telling jokes? → ||To harvest a few laughs.||",
  "What did one piece of bread say to the other at Thanksgiving? → ||Stop loafing around and butter me up.||"
]
